src/InformationRegisters/РезультатыТестирования/РезультатыТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыТестирования</name>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответ</name>
    <type>
      <types>CatalogRef.Ответы</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторПопытки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.Вопросы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РезультатыТестирования/ManagerModule.bsl
Функция ПолучитьИдентификаторНовойСессии() Экспорт

	Результат = Новый УникальныйИдентификатор;
	
	Набор = РегистрыСведений.РезультатыТестирования.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторПопытки.Установить(Результат);
	
	Для Каждого Вопрос Из ТестированиеСлужебный.ПодобратьВопросыДляТестирования() Цикл
		Запись = Набор.Добавить();
		Запись.ИдентификаторПопытки = Результат;
		Запись.Вопрос = Вопрос;
		Запись.ВремяНачала = ТекущаяДатаСеанса();
	КонецЦикла;
	
	Набор.Записать();
	
	Возврат Результат;
	
КонецФункции

Процедура ЗафиксироватьОтвет(Идентификатор, Вопрос, Ответ) Экспорт
	
	Запись = РегистрыСведений.РезультатыТестирования.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторПопытки = Идентификатор;
	Запись.Вопрос = Вопрос;
	
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Запись.ИдентификаторПопытки = Идентификатор;
		Запись.Вопрос = Вопрос;
		Запись.ВремяНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запись.Ответ = Ответ;
	Запись.ВремяОкончания = ТекущаяДатаСеанса();
	Запись.Результат = Ответ.Верный;
	Запись.Записать();
	
КонецПроцедуры
